% IDLAYOUT は、Graphical User Interface 用のあるレイアウトデフォルト
% (ident)を、System Identification Toolbox に設定します。
% このファイルを編集して、ユーザ自身のデフォルト設定を可能にします。
% 
% つぎの選択が可能です。
%   1. データアイコンとモデルアイコンのカラー (swt = 'colors')
%      colorcoded オブジェクトテーブルは、このファイルからカラーを選択し
%      ます。各モデルに対して、RGB 値を自由に編集できます。
%   2. 種々のプロットの中で、axes のサイズ(swt = 'axes')
%   3. 種々のプロットに関連したカラー(swt = 'plotcol')
%   4. プロットウインドウの中のメニュー選択に関連したデフォルト(swt = 
%      'figdefs' と、swt = 'plotdefs')
%   5. フォントサイズのデフォルト
%
% 注意：
% これらのデフォルトは、idprefs.mat ファイルを使って、書き換えることがで
% きます。ユーザの(IDENT ウインドウの OPTIONS メニューを使って)プリファ
% レンスにセーブしている場合、これらの選択のカレントのステータスが、つぎ
% の ident セッションで使われます。このオプションメニューでの DEFUALT の
% 使用は、カレントの m-ファイルの中で定義したデフォルトに戻すことになり
% ます。

%   Copyright 1986-2001 The MathWorks, Inc.
