% チャプタ－/サブセクション(CHAPTER/SUBSECTION)
% このコンポーネントは、レポートをタイトルと内容をもつセクションに分割し
% ます。セクションは、入れ子形式にすることができ、タイトルはサブセクショ
% ン内では自動的に小さくなります。利用可能な入れ子のレベルは7です。
% 
%   * チャプタ－
%   * セクション1-セクション5
%   * 単純なセクション
%
% チャプタ－/サブセクションコンポーネントが7コンポーネントレベル以上の入
% れ子形式の場合は、セクションは作成されませんが、サブコンポ－ネントの出
% 力はレポート内に表示されます。
%
% セクションのタイトルは、指定したり、または最初のサブコンポーネントから
% 決定することができます。
%
% このコンポーネントのサブコンポーネントは、セクション内に設置されます。
% タイトルが最初のサブコンポーネントから得られる場合には、セクションの内
% 容は、2番目のサブコンポーネントからサブコンポーネントリストの最後まで
% 記述されます。





% $Revision: 1.1.6.1 $ $Date: 2004/03/21 22:26:47 $
%   Copyright 1997-2002 The MathWorks, Inc.
