% MFEDIT メンバシップ関数エディタ
%
% mfedit('a') はファイルa.fisにストアされたFISのメンバシップ関数
%  の編集を行うメンバシップ関数エディタを開きます。
%
% mfedit(a)はMATLABのワークスペースのFIS構造体aの操作を行います
%
% meditはFISをロードせずにメンバシップ関数エディタを開きます。
%
% メンバシップ関数(MF)エディタは、与えられたファジィシステムに関する MF 
% の作成、削除、および、変更を行うために使うものです。ダイアグラムの左側
% にあるのは、表示されているボックスの1つをクリックすることでカレントの
% 値を選択する際に使う "variable palette" 領域です。カレントの値に関する
% 情報は、パレットエリアの下にあるテキスト領域に表示されます。
%
% 右側にあるのは、カレントの変数に対するすべての MF 群のプロットです。MF
% を示すライン、または、名前の上を1回クリックすると、これらのいずれかを
% 選択することができます。一度、選択すると、右下にあるコントロールを使っ
% て、その MF のプロパティを変更することができます。MF の追加と修正には
% Edit メニューを使います。
%
% 参考    FUZZY, RULEEDIT, RULEVIEW, SURFVIEW, ANFISEDIT



%   Copyright 1994-2002 The MathWorks, Inc. 
