% WILKINSON   Wilkinsonの固有値テスト行列
% 
% WILKINSON(n)は、J. H. Wilkinsonの固有値テスト行列Wn+を出力します。これ
% は、近い値の組合わせからなる対称な三重対角行列ですが、固有値には正確に
% は一致しません。最も頻繁に使われるのは、WILKINSON(21)です。たとえば、
% WILKINSON(7)は、つぎのようになります。
%
%          3  1  0  0  0  0  0
%          1  2  1  0  0  0  0
%          0  1  1  1  0  0  0
%          0  0  1  0  1  0  0
%          0  0  0  1  1  1  0
%          0  0  0  0  1  2  1
%          0  0  0  0  0  1  3


%   Copyright 1984-2002 The MathWorks, Inc. 
%   $Revision: 1.8.4.1 $  $Date: 2004/04/28 01:51:58 $
