% HAARINFO 　HAARウェーブレットに関する情報
%
% Haar Wavelet
%
% 一般的特性: 
% 最も古く、かつ最もシンプルなコンパクトサポートされたウェーブレットです。
% 
% スケーリング関数は、範囲 [0, 1] で、phi = 1、その他の場合は、0です。 
% ウェーブレット関数は、範囲 [0, 0.5] で、psi = 1、[0.5, 1] で、psi = -1、その他
% の場合は、0です。 
%
% ファミリ　              Haar
% 略称                    haar
% 例題                    haar は、db1 と等価です。
% 直交性                  あり
% 双直交性                あり
% コンパクトサポート      あり
% 離散ウェーブレット変換  可
% 連続ウェーブレット変換  可
%
% サポート長              1
% フィルタの長さ          2
% レギュラリティ          haar は、連続性をもちません。
% 対称性                  あり
% psiに関するvanishing モーメント数           1
%
% 参考文献： I. Daubechies, 
%            Ten lectures on wavelets, 
%            CBMS, SIAM, 61, 1994, 194-202.



%   Copyright 1995-2002 The MathWorks, Inc.
