% MAKESHOW   スライドショーのデモの作成
%
% このツールを使うことにより、ユーザ独自のグラフィックインタフェースを
% 作らなくても、対話的なスライドショーを作成することができます。
%
% このデモを行うためには、Command Windowにユーザ自身のMATLABコマンドをタ
% イプしてください。コマンドを実行し、カレントページの結果を見るためには、
% ctrl+returnを使ってください。テキストウィンドウに注釈のテキストをタイ
% プしてください。新しいスライドを作成するためには、"New"をクリックして
% ください。MAKESHOWは、残りの作業も行います。
%
% デモを終了するときには、"Save"ボタンを使ってファイルに保存できます。こ
% れにより、再度、デモを見たり修正するために、"Open"を使って、このファイ
% ルを開くことができます。スライドショーを行うためには、playshow('file-
% name')を実行してください。
% 
% MAKESHOW('filename')は、ファイルfilenameを開きます。 
%
% 参考： PLAYSHOW. 


%   Kelly Liu, Feb. 96
%   Copyright 1984-2002 The MathWorks, Inc.
