% XPSOUND    MATLABの音声機能のデモ
% 
% MATLABは、オーディオデータの開発に役立ちます。音声は、1次元の配列また
% はベクトルと考えられます。
% 
% このウィンドウを使って、音声を選択し、音声データをグラフィカルに表示す
% ることができます。コンピュータが音声機能をもっていれば、音声を再生した
% り、音量を選択できます。
% 
% 3種類の方法で、音声をグラフィカルに表示することができます。
%  
% 時系列は、時間の関数としてデータの2次元プロットです。
% 
% スペクトルは、音声の継続時間に対する信号の周波数の平均です。スペクトル
% は、周波数の関数として信号の大きさを表示します。
% 
% スペクトログラムは、時間の関数として信号の周波数成分を見るものです。時
% 間は左から右へと増加し、周波数は下から上へと増加します。
% 
% (スペクトルとスペクトログラムのオプションは、Signal Processing Toolbox
% が必要です) 



%   Denise L. Chen, 7-27-93
%   Copyright 1984-2002 The MathWorks, Inc.
%   $Revision: 1.8.4.1 $  $Date: 2004/04/28 01:49:44 $

