% RESPDEMO   モデル解析コマンドのデモ
%
%
% RESPDEMOは、線形時不変(LTI)モデルの一時的な応答と周波数応答をみるために、
% Control System Toolboxで利用可能なコマンドを使用します。
%
% 9つの基本応答のタイプが、解析に利用できます。
%
% 　　　*  ステップ
% 　　　*  インパルス
% 　　　*　ボード
% 　　　*　ナイキスト
% 　　　*　ニコルス
% 　　　*　シグマ
% 　　　*　極-零点
% 　　　*　根配置
%
% 各時刻、応答が選択され、ランダムな3次SISO状態空間モデルが作成され、対応する
% 応答のプロットが表示されます。
%
% 各応答のプロットでは、プロットのプロパティと応答特性に、右クリックにより表
% 示されるメニューを用いて、アクセスすることができます。
%
% 応答曲線上を左クリックすると、移動可能なデータマーカが作成されます。 データマー
% カは、指定の時間/周波数ポイントで、詳細な応答情報をみるために使用されます。
%


% Copyright 1986-2002 The MathWorks, Inc.
