% IDUISEL は、入力/出力データ変数とデータ部分の選択を管理します。
% 
%   FLAG:
%   open_portions データの一部を選択するためのダイアログボックスをオープ
%                 ンします。
%   open_io       入力と出力を選択するためのダイアログボックスをオープン
%                 します。
%   comput        サンプルと時間の一部の計算を行います。
%   samples       サンプルを使って表した部分の情報を取り扱います。
%   time          時間を使って表した部分の情報を取り扱います。
%   down,move,up  プロットウインドウの中にボックスの描画を取り扱います。
%   revert        最も新しく描かれた長方形を消去します。
%   insert        選択した部分の中のデータを読み込む
%   done          データ部分に関するダイアログボックスをクローズします。
%   detrend       データのドレンド除去
%   decim         データのリサンプル
%   revert_io     入力や出力の選択用に、すべてのエディトボックスをリセッ
%                 ト
%   insert_io     選択した入力と出力をもつデータを読み込む
%   done_io       入力/出力選択に関するダイアログボックスをクローズ

%   Copyright 1986-2001 The MathWorks, Inc.
