% キャラクタ文字列
%
% 一般関数
% char        - キャラクタ配列(文字列)の作成
% double      - 文字列を数値キャラクタコードに変換
% cellstr     - キャラクタ配列から文字列のセル配列を作成
% blanks      - ブランク文字列
% deblank     - 文字列の後尾からブランクを除去
% eval        - MATLAB表現を含む文字列の評価
%
% 文字列のテスト
% iscellstr   - 文字列からなるセル配列の検出
% ischar      - キャラクタ配列(文字列)の検出
% isspace     - 空白キャラクタの検出
% isstrprop   - 文字列の要素が指定したカテゴリであることを確認
%
% 文字列の操作
% regexp      - 一致する正規表現
% regexpi     - 無視する場合に一致する正規表現
% regexprep   - 正規表現の置き換え
% strcat      - 文字列の結合
% strvcat     - 文字列の垂直方向の結合
% strcmp      - 文字列の比較
% strncmp     - 文字列の最初のN個のキャラクタの比較
% strcmpi     - 大文字、小文字を無視して、文字列の比較
% strncmpi    - 大文字、小文字の区別を行わないで、文字列の最初のN個の
%               文字の比較
% findstr     - 長い文字列の中にある短い文字列パターンを検出
% strfind     - 1番目の引数の文字列の中にある2番目の引数の文字列パターン
%               を検出
% strjust     - キャラクタ配列の位置の調整
% strmatch    - 適合する文字列の検出
% strrep      - 文字列の置換
% strtok      - 文字列内のトークンの検出
% upper       - 文字列を大文字に変換
% lower       - 文字列を小文字に変換
%
% 文字列から数値への変換
% num2str     - 数値を文字列に変換
% int2str     - 整数を文字列に変換
% mat2str     - 行列をevalが可能な文字列に変換
% str2double  - 文字列を倍精度値に変換
% str2num     - 文字行列を数値に変換
% sprintf     - データを書式付きで文字列に書き出します
% sscanf      - 書式を制御して文字列を読み込みます
%
% 基底数値の変換
% hex2num     - IEEE 16進数を倍精度数値に変換
% hex2dec     - 16進数の文字列を10進整数に変換
% dec2hex     - 10進整数を16進数の文字列に変換
% bin2dec     - 2進数の文字列を10進整数に変換
% dec2bin     - 10進整数を2進数の文字列に変換
% base2dec    - Bで設定された基底で表わされた文字列を10進整数に変換
% dec2base    - 10進整数を基底Bの文字列に変換
%
% 参考：STRINGS.


%   Copyright 1984-2002 The MathWorks, Inc.
