% FUZZY  基本的な FIS エディタ
% 
% FIS エディタは、ファジィ推論システムに関する高水準の情報表示を行います。
% 最上部にあるのは、各入力と出力が明確にラベル付けされたシステムのダイア
% グラムです。入力、あるいは、出力ボックス上をダブルクリックすると、Me-
% mbership Function Editor を起動することができます。ダイアグラム中央の
% ファジィルールボックスをダブルクリックすると、Rule Editor を起動します。
% 
% ダイアグラムの真下にあるのは、カレントの FIS名を表示するテキストフィー
% ルドです。ウィンドウの左下にあるのは、ファジィ含意過程で使用する種々の
% 関数を設定することができる一連のポップアップメニューです。また、右下に
% あるのは、カレントの変数に関する情報を出力するフィールドです。カレント
% 変数を決定するには、入力、または、出力ボックスの1つをクリックします。
%
% 参考    MFEDIT, RULEEDIT, RULEVIEW, SURFVIEW, ANFISEDIT.



%   Copyright 1994-2002 The MathWorks, Inc. 
