% SURFVIEW 出力サーフェスビューア
% 
% surfview('a') によって実行される出力サーフェスビューアは、FIS ファイル
% a.fis の1個または2個の出力の出力サーフェスを表示する GUI ツールです。
% これは、ファジィシステムや関連した FIS 行列を変更することはないので、
% 読み取りのみのエディタです。ポップアップメニューを使って、表示したい2
% つの入力変数を2つの入力軸( X と Y )として選択し、1つの出力変数を出力軸
% ( Z 軸)に選択することができます。出力サーフェスを計算・表示するには、
% Evaluate ボタンを選択します。プロット軸をマウスでクリック、ドラッグす
% ることによって、サーフェスを実際に操作し、様々な角度から見ることができ
% ます。2入力以上のシステムの場合には、リファレンス入力部で、表示したく
% ない入力に定数を設定します。
%
% 参考 ANFISEDIT, FUZZY, GENSURF, MFEDIT, RULEEDIT, RULEVIEW



%   Copyright 1994-2002 The MathWorks, Inc. 
