% STEM3   3次元ステムプロット
% 
% STEM3(Z) は、データ値に対して円を終点とする、xy平面からのステムとして、
% 離散サーフェスZをプロットします。
%
% STEM3(X,Y,Z) は、X と Y で指定した値で、サーフェス Z をプロットします。
%
% STEM3(...,'filled') は、マーカを塗りつぶしたステムプロットを作成します。
%
% STEM3(...,LINESPEC) は、ステムとマーカに対して、指定したラインスタイル
% を使用します。使用可能な値については、PLOT を参照してください。
%
% STEM3(AX,...) は、GCAの代わりにAXにプロットします。
%
% H = STEM3(...) は、stemオブジェクトを出力します。
%
% 下位互換性
% STEM3('v6',...) は、MATLAB 6.5およびそれ以前のバージョンとの互換性の
% ため、stemシリーズオブジェクトの代わりにlineオブジェクトを作成します。
%  
% 参考：STEM, QUIVER3.


%   Copyright 1984-2002 The MathWorks, Inc. 
