% SIGBUILDER - グラフィカルな信号の編集ツール
%
% 信号、点、区分の選択:
%
% マウスのボタンを押しながら選択します。選択された信号は、ブレークポイント
% のそれぞれに菱形のマークで示されています。信号は、マーカー上をクリック
% することで選択可能なブレークポイントと、マーカー間をクリックすることで
% 選択可能な区分によって選択されます。点と区分の座標は、調整するための
% フィールド内に数値的に指定することも可能です。
%
% 点と区分の座標の調整:
%
% 信号は、点、または区分をドラッグすることによって編集され、左マウス
% ボタンでドラッグすることにより、新しいブレークポイント Y の値に調整
% することができます。ドラッグする前にシフトキーを押すと、ブレークポイ
% ントの時間の値が調整されます。垂直方向の(時間内で不連続な)区分は、
% 時間座標に沿って調整され、時間間隔の区分は、Y軸に沿って調整されます。
%
% グリッド設定の変更:
%
% 座標軸は、時間および/または、Y軸にグリッドラインを設定することができ
% ます。グリッドの設定は、信号のプロパティで、信号のコンテキストメニュー、
% または、信号のメニューから編集することができます。
% 
% 点の追加
%
% シフトキーを押しながら信号上をクリックすることによってその信号上に
% ブレークポイントが追加されます。


%  Copyright 1984-2002 The MathWorks, Inc.
