% デバッグコマンド
%
% dbstop     - ブレークポイントの設定
% dbclear    - ブレークポイントの消去
% dbcont     - 実行の再開
% dbdown     - ローカルワークスペースの内容の変更
% dbmex      - MEX-ファイルのデバッグ
% dbstack    - 対象関数を呼び出した関数の表示
% dbstatus   - すべてのブレークポイントのリスト
% dbstep     - ブレークポイントから複数ラインを実行
% dbtype     - ライン番号を付けてM-ファイルをリスト
% dbup       - ローカルワークスペースの内容の変更
% dbquit     - デバッグモードの終了
%
% ブレークポイントにヒットすると、MATLABはデバッグモードに入り、デバッガ
% ウィンドウがアクティブになり、プロンプトがK>に変化します。この状態で、
% 任意のMATLABコマンドが使用可能です。
%
% M-ファイル関数実行を再スタートするには、DBCONTやDBSTEPを使ってください。
% デバッガの使用を停止するには、DBQUITを使います。


%   Copyright 1984-2003 The MathWorks, Inc. 
