% COMPWIZ - report generatorコンポーネント作成ウィザード
% コンポーネント作成ウィザードは、Report Generatorコンポーネントの設定の
% ために必要な情報を集めた5つのページを含んでいます。
%
%   1) コンポ－ネントカテゴリ
%      新たなコンポーネントに対する一般的なカテゴリを設定します。既存の
%      カテゴリから選択したり、または新たなカテゴリを作成することができ
%      ます。
%   2) コンポ－ネント名
%      共通のコンポーネント名、関数名、コンポーネントが配置されるディレ
%      クトリを設定します。
%   3) コンポ－ネントの属性
%      "Options" ページに表示され、コンポーネントがレポート生成中にどの
%      ようにふるまうかに影響するスイッチを設定します。
%   4) コンポ－ネントメソッド
%      デフォルトのOUTLINESTRINGとATTRIBUTEの動作を継承するか、またはカ
%      スタマイズしたメソッドを作成するかどうかを決定します。
%   5) 選択の確認
%      行った決定をレビューし、コンポーネントを書き出すためには、"create"
%      をクリックします。
%
% 参考   SETEDIT, REPORT, RPTLIST, RPTCONVERT







%   Copyright 1997-2002 The MathWorks, Inc.
