% ガロア体配列に対してサポートされている操作
%
%   + -          - ガロア配列の加算と減算
%  
%   * / \        - ガロア配列の行列の乗算と除算
%  
%   .* ./ .\     - ガロア配列の要素ごとの乗算と除算
%  
%   ^            - ガロア配列の行列のべき乗
%  
%   .^           - ガロア配列の要素ごとのべき乗
%  
%   ' .'         - ガロア配列の転置
%  
%   ==, ~=       - ガロア配列に対する比較演算子
%      
%   all          - ガロアベクトルのすべての要素が非ゼロであるかどうかのテスト
%   any          - ガロアベクトルに非ゼロ要素があるかどうかのテスト
%   conv         - ガロアベクトルのコンボリューション
%   convmtx      - ガロア体ベクトルのコンボリューション行列
%   cosets       - ガロア体に対する円周等分剰余類の作成
%   deconv       - デコンボリューションと多項式の除算
%   det          - 正方ガロア行列の行列式
%   dftmtx       - ガロア体の離散フーリエ変換行列
%   diag         - ガロア行列の対角ガロア行列と対角要素
%   fft          - 離散フーリエ変換
%   filter       - ガロア体上での1次元ディジタルフィルタ
%   gf           - ガロア体配列の作成
%   gftable      - ガロア体の計算を高速化するためのファイルを生成
%   ifft         - 逆離散フーリエ変換
%   inv          - 逆ガロア行列
%   isprimitive  - ガロア体上の多項式が原始かどうかをチェック
%   length       - ガロアベクトルの長さ
%   log          - ガロア体のログ
%   lu           - ガロア配列のLU分解
%   minpoly      - ガロア要素に対する最小多項式の検出
%   mldivide     - ガロア体配列の行列の左除算 \
%   polyval      - ガロア体の多項式の計算
%   primpoly     - ガロア体に対する原始多項式の検出
%   rank         - ガロア配列のランク
%   reshape      - ガロア配列のサイズの変更
%   roots        - ガロア体の多項式の根を検出
%   size         - ガロア配列の大きさ
%   tril         - ガロア配列の下三角部分の抽出
%   triu         - ガロア配列の上三角部分の抽出
%
% 各関数の個々のヘルプを参照するには、"help gf/function" とタイプして
% ください。


%   Copyright 1996-2002 The MathWorks, Inc.
%   $Revision: 1.1.4.1 $   $ $


