% SYSTEM IDENTIFICATION TOOLBOXは、観測された入出力データに基づき、ダイナ
% ミックシステムの数学モデルを構築するためのツールを含む、解析モジュール
% です。このToolboxは、パラメトリックモデリングとノンパラメトリックモデリ
% ングの両方の機能を持っています。
%
% Identification Toolbox のデモンストレーション：
%
%   1) グラフィカル・ユーザ・インタフェース(ident): 操作手順の指標
%   2) 実験プロセスでの実データからの簡易モデルの構築
%   3) 異なる同定手法の比較
%   4) ツールボックスで用意しているデータとモデルオブジェクト
%   5) 多変数システムの取り扱い
%   6) 構造化されたユーザ定義モデルの作成
%   7) モデル構造決定のケーススタディ
%   8) 複数の実験の取り扱い
%   9) スペクトル推定 (Marpleの試験ケース)
%   10) 適応/逐次アルゴリズム
%   11) ケーススタディ
%
%   0) 終了

%   Copyright 1986-2001 The MathWorks, Inc.
